Repository: Spacebody/Vela
Catalog: Vela/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# legacy.macosRequiresApprovalBeforeVelaCanLaunchAtLogin
source: macOS requires approval before Vela can launch at login.
zh_hans: Vela 登录时启动前需要获得 macOS 批准。

# legacy.managedPort
source: Managed Port
zh_hans: 托管端口

# legacy.manifest
source: Manifest
zh_hans: 清单

# legacy.manifestVersion
source: Manifest Version
zh_hans: 清单版本

# legacy.menuBarBehavior
source: Menu Bar Behavior
zh_hans: 菜单栏行为

# legacy.message
source: Message
zh_hans: 消息

# legacy.mihomoCore
source: Mihomo Core
zh_hans: Mihomo 内核

# legacy.mihomoDidNotExposeTheProviderPayload
source: Mihomo did not expose the provider payload.
zh_hans: Mihomo 未提供此供应商的载荷。

# legacy.mihomoDidNotReportAnyProxyNodesForThisProvider
source: Mihomo did not report any proxy nodes for this provider.
zh_hans: Mihomo 未报告此供应商的任何代理节点。

# legacy.mihomoSRuntimeRulesResponseDoesNotExposeSourceLayerProvenance
source: Mihomo's runtime rules response does not expose source-layer provenance
zh_hans: Mihomo 的运行时规则响应不包含来源层信息

source: Mihomo will terminate every active connection. Applications may reconnect immediately.
zh_hans: Mihomo 将终止所有活跃连接。应用可能会立即重新连接。

# legacy.minimumCustomInterval
source: Minimum Custom Interval
zh_hans: 最短自定义间隔

# legacy.missCount
source: Miss Count
zh_hans: 未命中次数

# legacy.modeObjectFormat
source: %@ Mode
zh_hans: %@ 模式

# legacy.more
source: More
zh_hans: 更多

# legacy.moreConnectionsIntegerFormat
source: %lld more connections
zh_hans: 另有 %lld 个连接

# legacy.moreProxiesIntegerFormat
source: %lld more proxies
zh_hans: 另有 %lld 个代理节点

# legacy.movesToTheNextSetupStep
source: Moves to the next setup step
zh_hans: 前往下一个设置步骤

# legacy.msIntegerFormat
source: %u ms
zh_hans: %u 毫秒

# legacy.name
source: Name
zh_hans: 名称

# legacy.nameTypeOrProvider
source: Name, type, or provider
zh_hans: 名称、类型或供应商

# legacy.networkModes
source: Network Modes
zh_hans: 网络模式

# legacy.networkTun
source: Network · TUN
zh_hans: 网络 · TUN

# legacy.newBearerToken
source: New Bearer Token
zh_hans: 新 Bearer Token

# legacy.newPassword
source: New Password
zh_hans: 新密码

# legacy.newUsername
source: New Username
zh_hans: 新用户名

# legacy.noAuthoritativeControllerSamplesAreAvailable
source: No authoritative Controller samples are available.
zh_hans: 没有可用的权威 Controller 样本。

# legacy.nodes
source: Nodes
zh_hans: 节点

# legacy.noGroups
source: No groups
zh_hans: 没有代理组

# legacy.none
source: None
zh_hans: 无

# legacy.noNetworkModeIsEnabledAutomatically
source: No network mode is enabled automatically.
zh_hans: 不会自动启用任何网络模式。

# legacy.noRecentProxies
source: No recent proxies
zh_hans: 没有最近使用的代理节点

# legacy.notarizationEvidence
source: Notarization Evidence
zh_hans: 公证证据

source: No terminal commands are required. Enabling TUN remains a separate explicit action after approval succeeds.
zh_hans: 无需运行终端命令。批准成功后，启用 TUN 仍需单独明确操作。

# legacy.notice
source: Notice
zh_hans: 声明

# legacy.notNow
source: Not Now
zh_hans: 暂不

# legacy.noTrafficTrend
source: No traffic trend
zh_hans: 暂无流量趋势

# legacy.notRequested
source: Not requested
zh_hans: 未请求

# legacy.notStarted
source: Not Started
zh_hans: 尚未开始

# legacy.notYetAvailable
source: Not yet available
zh_hans: 尚不可用

# legacy.ofIntegerFormat
source: %lld of %lld
zh_hans: %lld / %lld

# legacy.ofProxiesIntegerFormat
source: %lld of %lld proxies
zh_hans: %lld / %lld 个代理节点

# legacy.ofRulesIntegerFormat
source: %lld of %lld rules
zh_hans: %lld / %lld 条规则

# legacy.ok
source: OK
zh_hans: 好

source: One or more settings already point to Vela's port, so Vela cannot safely restore a baseline it did not create.
zh_hans: 一项或多项设置已指向 Vela 的端口，因此 Vela 无法安全恢复并非由自身创建的基线。

# legacy.openConfiguration
source: Open Configuration
zh_hans: 打开配置

# legacy.openConfigurationWorkbenchToAddARule
source: Open Configuration Workbench to add a rule
zh_hans: 打开配置工作台以添加规则

# legacy.openDataDirectory
source: Open Data Directory
zh_hans: 打开数据目录

# legacy.openDiagnostics
source: Open Diagnostics
zh_hans: 打开诊断

# legacy.openLoginItemsSettings
source: Open Login Items Settings
zh_hans: 打开登录项设置

# legacy.openProviders
source: Open Providers
zh_hans: 打开供应商

# legacy.opensAFileChooserForAYamlOrJsonConfiguration
source: Opens a file chooser for a YAML or JSON configuration
zh_hans: 打开文件选择器以选择 YAML 或 JSON 配置

# legacy.openSettingsToInstallOrApproveThePrivilegedComponent
source: Open Settings to install or approve the privileged component.
zh_hans: 打开设置以安装或批准特权组件。

# legacy.openSource
source: Open Source
zh_hans: 开源信息

# legacy.openSystemSettings
source: Open System Settings
zh_hans: 打开系统设置

# legacy.openTheBundledMihomoReleasePage
source: Open the bundled Mihomo release page
zh_hans: 打开捆绑的 Mihomo 发行页面

# legacy.openTheReleaseNotesRetainedInThisCoreSSignedCatalogEvidence
source: Open the release notes retained in this Core's signed Catalog evidence
zh_hans: 打开此 内核 的签名 目录 证据中保留的发行说明

# legacy.openTheSourceCodeForTheBundledMihomoRelease
source: Open the source code for the bundled Mihomo release
zh_hans: 打开捆绑 Mihomo 发行版的源代码

# legacy.openTunSetup
source: Open TUN Setup
zh_hans: 打开 TUN 设置

# legacy.openVela
source: Open Vela
zh_hans: 打开 Vela

source: Operational summary only. Review every error before changing network or privileged settings.
zh_hans: 这里只提供运行摘要。更改网络或特权设置前，请逐项检查所有错误。

# legacy.optionalSignedCoreObjectFormat
source: Optional signed Core · %@
zh_hans: 可选签名 内核 · %@

# legacy.optionalTools
source: Optional Tools
zh_hans: 可选工具

# legacy.optionalToolsStayOptional
source: Optional Tools Stay Optional
zh_hans: 可选工具始终可选

# legacy.outOf100IntegerObjectFormat
source: %lld out of 100, %@
zh_hans: 满分 100，当前 %lld；%@

# legacy.overview
source: Overview
zh_hans: 概览

# legacy.password
source: Password
zh_hans: 密码

# legacy.pause
source: Pause
zh_hans: 暂停

# legacy.pauseAutoScroll
source: Pause Auto-scroll
zh_hans: 暂停自动滚动

# legacy.pausedUntilObjectFormat
source: Paused until %@
zh_hans: 暂停至 %@

# legacy.pauseTun
source: Pause TUN
zh_hans: 暂停 TUN

# legacy.pauseUiUpdates
source: Pause UI Updates
zh_hans: 暂停界面更新

# legacy.payload
source: Payload
zh_hans: 载荷

# legacy.permissionPromptsHaveContext
source: Permission prompts have context
zh_hans: 权限请求会先说明原因

# legacy.pinned
source: Pinned
zh_hans: 已固定

# legacy.platform
source: Platform
zh_hans: 平台

# legacy.policy
source: Policy
zh_hans: 策略

source: Ports accept one value or ascending range per line, such as `80` or `443-8443`. Domain and CIDR lists are validated before Save.
zh_hans: 端口每行可填写一个值或升序范围，例如 `80` 或 `443-8443`。保存前会验证域名和 CIDR 列表。

# legacy.preferences
source: Preferences
zh_hans: 偏好设置

# legacy.previewRedactedDiagnostics
source: Preview Redacted Diagnostics
zh_hans: 预览已脱敏诊断

# legacy.previousMode
source: Previous Mode
zh_hans: 之前的模式

# legacy.privacy
source: Privacy
zh_hans: 隐私

# legacy.privacyByDefault
source: Privacy by Default
zh_hans: 默认保护隐私

# legacy.probationEnds
source: Probation Ends
zh_hans: 试用期结束

source: Production Core Catalog URL and signing roots are intentionally fail-closed until release credentials are provisioned.
zh_hans: 在配置发行凭据前，生产 内核 目录 URL 和签名根会有意保持失败关闭状态。

# legacy.profiles
source: Profiles
zh_hans: 配置

source: Profiles, revisions, runtime candidates, overrides, and diagnostics remain inside Vela's protected Application Support directory.
zh_hans: 配置、修订版本、运行时候选项、覆盖项和诊断信息均保留在 Vela 受保护的 Application Support 目录中。

# legacy.progressIsSavedLocallyYouCanSkipNowAndResumeFromTheLastStep
source: Progress is saved locally. You can skip now and resume from the last step.
zh_hans: 进度会保存在本地。你可以现在跳过，稍后从上次步骤继续。

# legacy.protocol
source: Protocol
zh_hans: 协议

# legacy.providerHealthCheckSummary
source: Provider Health Check Summary
zh_hans: 供应商健康检查摘要

# legacy.providerInspector
source: Provider Inspector
zh_hans: 供应商检查器

# legacy.providerName
source: Provider name
zh_hans: 供应商名称

# legacy.providers
source: Providers
zh_hans: 供应商

# legacy.providerSubscriptionUsage
source: Provider subscription usage
zh_hans: 供应商订阅用量

# legacy.providerType
source: Provider Type
zh_hans: 供应商类型

# legacy.providerUpdateSummary
source: Provider Update Summary
zh_hans: 供应商更新摘要

# legacy.proxies
source: Proxies
zh_hans: 代理节点

# legacy.proxy
source: Proxy
zh_hans: 代理节点

# legacy.proxyGroup
source: Proxy Group
zh_hans: 代理组

# legacy.proxyProvider
source: Proxy Provider
zh_hans: 代理供应商

# legacy.proxyProviders
source: Proxy Providers
zh_hans: 代理供应商

# legacy.quicSniffing
source: QUIC Sniffing
zh_hans: QUIC 嗅探

# legacy.quitVela
source: Quit Vela
zh_hans: 退出 Vela

# legacy.rawPrivilegedStartupLogsAreExcludedByDefault
source: Raw privileged startup logs are excluded by default.
zh_hans: 默认不包含原始特权启动日志。

# legacy.readingTheActiveControllerProviderCatalog
source: Reading the active Controller provider catalog.
zh_hans: 正在读取活动 Controller 的供应商目录。

# legacy.readOnly
source: Read-only
zh_hans: 只读

# legacy.reasonCoreFailedObjectFormat
source: Reason: core.%@.failed · %@
zh_hans: 原因：core.%@.failed · %@

# legacy.receiveBetaUpdatesQuestion
source: Receive Beta Updates?
zh_hans: 接收 Beta 更新？

# legacy.recentHistoryUnavailable
source: Recent history unavailable
zh_hans: 最近记录不可用

# legacy.recentlyUsed
source: Recently used
zh_hans: 最近使用

# legacy.recentProxies
source: Recent Proxies
zh_hans: 最近使用的代理节点

# legacy.recommended
source: Recommended
zh_hans: 推荐

# legacy.reconnect
source: Reconnect
zh_hans: 重新连接

# legacy.reconnectAndVerify
source: Reconnect and Verify
zh_hans: 重新连接并验证

# legacy.refresh
source: Refresh
zh_hans: 刷新

# legacy.refreshConnections
source: Refresh connections
zh_hans: 刷新连接

# legacy.refreshHealth
source: Refresh Health
zh_hans: 刷新健康状态

# legacy.refreshingRules
source: Refreshing rules
zh_hans: 正在刷新规则

# legacy.refreshProxies
source: Refresh Proxies
zh_hans: 刷新代理节点

# legacy.refreshProxyGroupsAndTheirCurrentSelections
source: Refresh proxy groups and their current selections
zh_hans: 刷新代理组及其当前选择

# legacy.refreshRuntimeRules
source: Refresh runtime rules
zh_hans: 刷新运行时规则

# legacy.refreshStoreParity
source: Refresh Store Parity
zh_hans: 刷新存储一致性

# legacy.refreshTheProcessControllerAndNetworkHealthState
source: Refresh the process, Controller, and network health state
zh_hans: 刷新进程、Controller 和网络健康状态

# legacy.registration
source: Registration
zh_hans: 注册

# legacy.registrationXpcAuthentication
source: Registration & XPC Authentication
zh_hans: 注册与 XPC 认证

# legacy.reinstall
source: Reinstall
zh_hans: 重新安装

# legacy.reinstallComponent
source: Reinstall Component
zh_hans: 重新安装组件

# legacy.reinstallPrivilegedComponentQuestion
source: Reinstall Privileged Component?
zh_hans: 重新安装特权组件？

# legacy.release
source: Release
zh_hans: 发行信息

# legacy.releaseDate
source: Release Date
zh_hans: 发布日期

# legacy.releaseNotes
source: Release Notes
zh_hans: 发行说明

# legacy.remoteProfile
source: Remote Profile
zh_hans: 远程配置

# legacy.remoteSubscription
source: Remote Subscription
zh_hans: 远程订阅

# legacy.remove
source: Remove
zh_hans: 移除

# legacy.repairVerifyRollback
source: Repair & Verify Rollback
zh_hans: 修复并验证回滚

# legacy.replacementUrlLeaveBlankToKeepCurrent
source: Replacement URL (leave blank to keep current)
zh_hans: 替换 URL（留空则保留当前值）

# legacy.repository
source: Repository
zh_hans: 代码仓库

# legacy.restore
source: Restore
zh_hans: 恢复

# legacy.restoreSystemProxy
source: Restore System Proxy
zh_hans: 恢复系统代理

# legacy.restoreSystemProxyAfterTun
source: Restore System Proxy after TUN
zh_hans: TUN 结束后恢复系统代理

# legacy.restoreSystemProxyMode
source: Restore System Proxy Mode
zh_hans: 恢复系统代理模式

# legacy.results
source: Results
zh_hans: 结果

# legacy.resumeAutoScroll
source: Resume Auto-scroll
zh_hans: 恢复自动滚动

# legacy.resumeFollowingNewLogs
source: Resume following new logs
zh_hans: 恢复跟随新日志

# legacy.resumeTun
source: Resume TUN
zh_hans: 恢复 TUN

# legacy.resumeUiUpdates
source: Resume UI Updates
zh_hans: 恢复界面更新

# legacy.retainedVerificationEvidence
source: Retained Verification Evidence
zh_hans: 保留的验证证据

# legacy.retry
source: Retry
zh_hans: 重试

# legacy.retryFailed
source: Retry Failed
zh_hans: 重试失败项

# legacy.retryVerification
source: Retry Verification
zh_hans: 重试验证

# legacy.reveal
source: Reveal
zh_hans: 显示

# legacy.revealed
source: Revealed
zh_hans: 已显示

# legacy.revealRedactedUrl
source: Reveal Redacted URL
zh_hans: 显示已脱敏 URL

source: Re-verifies the User Core, then copies only fixed signed roles through Helper protocol v2. It does not activate TUN.
zh_hans: 重新验证用户 内核，然后通过特权组件协议 v2 仅复制固定的签名角色。此操作不会启用 TUN。

# legacy.revertDraft
source: Revert Draft
zh_hans: 还原草稿

source: Review the exact counts and state that will be saved. Privileged Mihomo startup logs, URLs, credentials, connection content, and process paths are excluded.
zh_hans: 请检查将要保存的确切计数和状态。其中不包含特权 Mihomo 启动日志、URL、凭据、连接内容和进程路径。

# legacy.rollback
source: Rollback
zh_hans: 回滚

# legacy.rootRuntimeTun
source: Root Runtime & TUN
zh_hans: Root 运行时与 TUN

# legacy.routeExclusionsCidrCommaSeparated
source: Route exclusions (CIDR, comma separated)
zh_hans: 路由排除项（CIDR，以逗号分隔）

# legacy.routesAppsThatHonorMacosProxySettingsEnablingItLaterIsAnExplicitAction
source: Routes apps that honor macOS proxy settings. Enabling it later is an explicit action.
zh_hans: 路由遵循 macOS 代理设置的应用。稍后启用时仍需明确操作。

# legacy.rule
source: Rule
zh_hans: 规则

# legacy.ruleCount
source: Rule Count
zh_hans: 规则数量

# legacy.ruleIntegerFormat
source: Rule #%lld
zh_hans: 规则 #%lld

# legacy.ruleProvider
source: Rule Provider
zh_hans: 规则供应商

# legacy.ruleProviders
source: Rule Providers
zh_hans: 规则供应商

# legacy.rules
source: Rules
zh_hans: 规则

# legacy.rulesMode
source: Rules Mode
zh_hans: 规则模式

# legacy.runChecks
source: Run Checks
zh_hans: 运行检查

# legacy.runCleanup
source: Run Cleanup
zh_hans: 运行清理

# legacy.runCoreIntegrityRuntimeHealthControllerAndProviderChecks
source: Run core integrity, runtime health, Controller, and provider checks
zh_hans: 运行 内核 完整性、运行时健康、Controller 和供应商检查

# legacy.runDiagnostics
source: Run Diagnostics
zh_hans: 运行诊断

# legacy.runningChecks
source: Running Checks
zh_hans: 正在运行检查

# legacy.runPrivilegedCleanupQuestion
source: Run Privileged Cleanup?
zh_hans: 运行特权清理？

# legacy.runtime
source: Runtime
zh_hans: 运行时

# legacy.runtimeState
source: Runtime State
zh_hans: 运行时状态

# legacy.runtimeToggleUnavailable
source: Runtime toggle unavailable
zh_hans: 运行时切换不可用

# legacy.safeToPause
source: Safe to pause
zh_hans: 可随时暂停

# legacy.save
source: Save
zh_hans: 保存

# legacy.saveRedactedDiagnosticsDialog
source: Save Redacted Diagnostics…
zh_hans: 保存已脱敏诊断…

# legacy.savesThisStepSoSetupCanBeResumedLater
source: Saves this step so setup can be resumed later
zh_hans: 保存当前步骤，以便稍后继续设置

# legacy.savingSubscriptionSettings
source: Saving subscription settings
zh_hans: 正在保存订阅设置

# legacy.sceneEditingIsEnabledAfterTheConfigurationLayerCutover
source: Scene editing is enabled after the configuration-layer cutover.
zh_hans: 完成配置层切换后即可编辑场景。

# legacy.scenes
source: Scenes
zh_hans: 场景

# legacy.schedule
source: Schedule
zh_hans: 计划

# legacy.searchConnections
source: Search connections
zh_hans: 搜索连接

# legacy.searchLogMessages
source: Search log messages
zh_hans: 搜索日志消息

# legacy.searchRules
source: Search rules
zh_hans: 搜索规则

# legacy.selectAll
source: Select All
zh_hans: 全选

# legacy.selectAProviderToInspectItsSourceUsageHealthAndPayloadDetails
source: Select a provider to inspect its source, usage, health, and payload details.
zh_hans: 选择一个供应商以检查其来源、用量、健康状态和负载详情。

# legacy.selectedProfile
source: Selected Profile
zh_hans: 所选配置

# legacy.selection
source: Selection
zh_hans: 选择

# legacy.selectNone
source: Select None
zh_hans: 全部取消选择

# legacy.settings
source: Settings
zh_hans: 设置

# legacy.settingsCategory
source: Settings Category
zh_hans: 设置类别

# legacy.settingsUnavailable
source: Settings Unavailable
zh_hans: 设置不可用

# legacy.setupEndsWithTheSameNetworkStateYouStartedWith
source: Setup ends with the same network state you started with.
zh_hans: 设置结束时的网络状态与开始时相同。

# legacy.setupIsReadyToFinish
source: Setup is ready to finish
zh_hans: 设置已可完成

source: Setup progress contains step identifiers and timestamps. It never stores configuration secrets or subscription input.
zh_hans: 设置进度只包含步骤标识和时间戳，绝不会存储配置密钥或订阅输入。

# legacy.setUpVela
source: Set Up Vela
zh_hans: 设置 Vela

# legacy.showInspector
source: Show Inspector
zh_hans: 显示检查器

# legacy.showProxyDetails
source: Show proxy details
zh_hans: 显示代理节点详情

# legacy.showTheConnectionInspector
source: Show the connection inspector
zh_hans: 显示连接检查器

# legacy.showTheProviderInspector
source: Show the provider inspector
zh_hans: 显示供应商检查器

# legacy.showTheRuleInspector
source: Show the rule inspector
zh_hans: 显示规则检查器

# legacy.showTheSourceInspector
source: Show the source inspector
zh_hans: 显示来源检查器

# legacy.signedCoreLifecycle
source: Signed Core Lifecycle
zh_hans: 签名 内核 生命周期

# legacy.signedCoreLifecycleIsUnavailableInThisEnvironment
source: Signed Core lifecycle is unavailable in this environment.
zh_hans: 此环境中无法使用签名 内核 生命周期。

# legacy.signedUpstreamLinks
source: Signed Upstream Links
zh_hans: 已签名的上游链接

# legacy.signingTeam
source: Signing Team
zh_hans: 签名团队

# legacy.size
source: Size
zh_hans: 大小

# legacy.skipped
source: Skipped
zh_hans: 已跳过

# legacy.skipSetup
source: Skip Setup
zh_hans: 跳过设置

# legacy.sniffer
source: Sniffer
zh_hans: 嗅探

# legacy.someProvidersNeedAttention
source: Some Providers Need Attention
zh_hans: 部分供应商需要处理

# legacy.soon
source: Soon
zh_hans: 即将推出

# legacy.sort
source: Sort
zh_hans: 排序

# legacy.sortBy
source: Sort By
zh_hans: 排序依据

# legacy.source
source: Source
zh_hans: 来源

source: Source layer, runtime index, and confidence are not exposed by this live connection response.
zh_hans: 此实时连接响应不包含来源层、运行时索引和可信度。

# legacy.sourceMetadata
source: Source Metadata
zh_hans: 来源元数据

# legacy.stack
source: Stack
zh_hans: 协议栈

# legacy.started
source: Started
zh_hans: 已启动

# legacy.startMihomo
source: Start Mihomo
zh_hans: 启动 Mihomo

# legacy.state
source: State
zh_hans: 状态

# legacy.status
source: Status
zh_hans: 状态

# legacy.stepOfObjectFormat
source: Step %@ of %@
zh_hans: 第 %@ 步，共 %@ 步

# legacy.stopMihomo
source: Stop Mihomo
zh_hans: 停止 Mihomo

# legacy.stopOwnedRuntimeAndClean
source: Stop Owned Runtime and Clean
zh_hans: 停止 Vela 所有的运行时并清理

# legacy.stopTun
source: Stop TUN
zh_hans: 停止 TUN

# legacy.stopVelaWaitingForTheResponseMihomoMayContinueTheUpdate
source: Stop Vela waiting for the response; Mihomo may continue the update
zh_hans: 停止让 Vela 等待响应；Mihomo 可能继续更新

# legacy.subscriptionUpdates
source: Subscription Updates
zh_hans: 订阅更新

# legacy.subscriptionUrl
source: Subscription URL
zh_hans: 订阅 URL

# legacy.subscriptionUsage
source: Subscription usage
zh_hans: 订阅用量

# legacy.succeeded
source: Succeeded
zh_hans: 成功

# legacy.switchingToObjectFormat
source: Switching to %@
zh_hans: 正在切换到 %@

# legacy.syncActiveCoreForTun
source: Sync Active Core for TUN
zh_hans: 为 TUN 同步当前 内核

# legacy.syncForTun
source: Sync for TUN
zh_hans: 为 TUN 同步

# legacy.systemProxy
source: System Proxy
zh_hans: 系统代理

# legacy.systemProxyAndTunSolveDifferentProblemsNeitherIsEnabledHere
source: System Proxy and TUN solve different problems; neither is enabled here.
zh_hans: 系统代理和 TUN 解决不同问题；此处不会启用任何一种模式。

# legacy.systemProxyChangesContinueToUseVelaSOwnershipAndRestoreTransaction
source: System Proxy changes continue to use Vela's ownership and restore transaction.
zh_hans: 系统代理更改仍使用 Vela 的所有权与恢复事务。

# legacy.systemProxyExternal
source: System Proxy · External
zh_hans: 系统代理 · 外部管理

# legacy.systemProxyOperationInProgress
source: System proxy operation in progress
zh_hans: 系统代理操作正在进行

# legacy.target
source: Target
zh_hans: 目标

# legacy.team
source: Team
zh_hans: 团队

# legacy.test
source: Test
zh_hans: 测试

# legacy.testEveryNodeInTheSelectedProxyGroup
source: Test every node in the selected proxy group
zh_hans: 测试所选代理组中的每个节点

# legacy.testGroup
source: Test Group
zh_hans: 测试代理组

# legacy.testingDelay
source: Testing delay
zh_hans: 正在测试延迟

# legacy.testingProxyGroup
source: Testing proxy group
zh_hans: 正在测试代理组

# legacy.testObjectFormat
source: Test %@
zh_hans: 测试 %@

# legacy.testUrl
source: Test URL
zh_hans: 测试 URL

# legacy.theBundledLicenseAndNoticeCouldNotBeLoaded
source: The bundled license and notice could not be loaded.
zh_hans: 无法载入捆绑的许可证和声明。

source: The current URL is intentionally redacted. Query parameters and credentials are never revealed by this editor.
zh_hans: 当前 URL 已有意脱敏。此编辑器绝不会显示查询参数或凭据。

source: The Helper validates the caller, executable, configuration, paths, and owner lease before starting a privileged runtime. Vela never asks you to paste a terminal command or type an administrator password into the app.
zh_hans: 特权组件会在启动特权运行时前验证调用方、可执行文件、配置、路径和所有者租约。Vela 绝不会要求你粘贴终端命令或在应用中输入管理员密码。

# legacy.theProfileRevisionsOverridesAndStoredSubscriptionCredentialsWillBeRemoved
source: The profile, revisions, overrides, and stored subscription credentials will be removed.
zh_hans: 此配置、修订版本、覆盖项以及存储的订阅凭据都将被移除。

source: The runtime rules endpoint does not expose whether this rule came from upstream, global, profile, or scene layers. Open Configuration Workbench when editable source mapping is available.
zh_hans: 运行时规则端点不会说明此规则来自上游、全局、配置还是场景层。可编辑的来源映射可用后，请在配置工作台中打开。

# legacy.thisMihomoRuleDoesNotSupportRuntimeToggling
source: This Mihomo rule does not support runtime toggling
zh_hans: 此 Mihomo 规则不支持运行时切换

# legacy.thisRemovesTheInMemoryLogBufferThisActionCannotBeUndone
source: This removes the in-memory log buffer. This action cannot be undone.
zh_hans: 这会移除内存中的日志缓冲区。此操作无法撤销。

# legacy.time
source: Time
zh_hans: 时间

# legacy.tlsSniffing
source: TLS Sniffing
zh_hans: TLS 嗅探

# legacy.toggleInspector
source: Toggle Inspector
zh_hans: 切换检查器

# legacy.trafficTrend
source: Traffic trend
zh_hans: 流量趋势

# legacy.transition
source: Transition
zh_hans: 切换

# legacy.tryAgain
source: Try Again
zh_hans: 重试

source: TUN auto-route remains enabled. Local subnets are detected at start and merged with your exclusions when Allow Local Network is on.
zh_hans: TUN 自动路由保持启用。打开“允许本地网络”后，Vela 会在启动时检测本地子网，并与排除项合并。

# legacy.tunMode
source: TUN Mode
zh_hans: TUN 模式

# legacy.tunMustBeOffMacosMayRequireApprovalAgain
source: TUN must be off. macOS may require approval again.
zh_hans: 必须先关闭 TUN。macOS 可能会再次要求批准。

# legacy.tunSetupProgress
source: TUN setup progress
zh_hans: TUN 设置进度

# legacy.tunSetupRequired
source: TUN setup required
zh_hans: 需要设置 TUN

# legacy.tunWiFiNameAccessAndLaunchAtLoginAreRequestedOnlyAtTheMomentOfUse
source: TUN, Wi-Fi name access, and Launch at Login are requested only at the moment of use.
zh_hans: 仅在实际使用时，才会请求 TUN、Wi-Fi 名称访问和登录时启动权限。

# legacy.turnOffTunBeforeChangingFieldsThatRequireAValidatedRuntimeRebuild
source: Turn off TUN before changing fields that require a validated runtime rebuild.
zh_hans: 更改需要重新构建已验证运行时的字段前，请先关闭 TUN。

# legacy.type
source: Type
zh_hans: 类型

# legacy.unavailable
source: Unavailable
zh_hans: 不可用

# legacy.uninstall
source: Uninstall
zh_hans: 卸载

# legacy.uninstallKeepCleanDiagnosticsMetadata
source: Uninstall & Keep Clean Diagnostics Metadata
zh_hans: 卸载并保留清理诊断元数据

# legacy.uninstallRemoveRuntimeData
source: Uninstall & Remove Runtime Data
zh_hans: 卸载并移除运行时数据

# legacy.unknown
source: Unknown
zh_hans: 未知

# legacy.up
source: Up
zh_hans: 上传

# legacy.update
source: Update
zh_hans: 更新

# legacy.updateAll
source: Update All
zh_hans: 全部更新

# legacy.updateAllRemoteProfiles
source: Update All Remote Profiles
zh_hans: 更新所有远程配置

# legacy.updateAutomatically
source: Update automatically
zh_hans: 自动更新

# legacy.updated
source: Updated
zh_hans: 已更新

# legacy.updateDiagnosticsAreGeneratedLocallyAndAreNotUploadedAutomatically
source: Update diagnostics are generated locally and are not uploaded automatically.
zh_hans: 更新诊断信息在本地生成，不会自动上传。

# legacy.updateNow
source: Update Now
zh_hans: 立即更新

# legacy.updates
source: Updates
zh_hans: 更新

# legacy.updateSelectedRemoteProfile
source: Update Selected Remote Profile
zh_hans: 更新所选远程配置

# legacy.updateStatus
source: Update Status
zh_hans: 更新状态

# legacy.updateThisRemoteProfileNow
source: Update this remote profile now
zh_hans: 立即更新此远程配置
